/*
 * Задача 5.  Алгоритм сжатия данных Хаффмана (6 баллов и более)
 */

/*
Напишите две функции для создания архива из одного файла и извлечения файла из архива.

В архиве сохраняйте дерево Хаффмана и код Хаффмана от исходных данных.
Дерево Хаффмана требуется хранить эффективно - не более 10 бит на каждый 8-битный символ.
В контест необходимо отправить .cpp файл содержащий функции Encode, Decode, а также включающий файл Huffman.h. Тестирующая программа выводит размер сжатого файла в процентах от исходного.
Лучшие 3 решения с Kc <= 50% из каждой группы оцениваются в 15, 10 и 5 баллов соответственно.
 */